In [1]:
import pandas as pd
df=pd.DataFrame({'data':['10/2/2011','11/2/2011','12/2/2011','13/12/2011'],
                  'Event':['music','poetry','theatre','comedy'],
                  'cost':[10000,5000,15000,2000]})
df
df['Discount_price']=df.apply(lambda a:a.cost-(a.cost*0.1),axis=1)
df

         data    Event   cost  Discount_price
0   10/2/2011    music  10000          9000.0
1   11/2/2011   poetry   5000          4500.0
2   12/2/2011  theatre  15000         13500.0
3  13/12/2011   comedy   2000          1800.0